miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015-2018) Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* File Name    : r_tfat_drv_if.c
* Description  : TFAT driver Interface.
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 01.12.2014 1.00     First Release
*              : 21.01.2015 1.01     Added Support USB Mini Firmware.
*              : 22.06.2015 1.02     Added support MCU RX231.
*              : 01.04.2016 1.03     Updated the xml file.
*              : 29.06.2018 1.04     Modified R_tfat_get_fattime() and SD memory device.
*******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
*******************************************************************************/
#include "platform.h"
#include "r_tfat_driver_rx_if.h"
#include "r_tfat_driver_rx_config.h"
#include "r_tfat_drv_if_dev.h"
#include "r_sys_time_rx_if.h"

/*******************************************************************************
Macro definitions
*******************************************************************************/
/* for USB */
#if (TFAT_USB_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_USB)
#define USB_NUM_0    (1)
#define DRV0_DEV_CH  (0)
#else
#define USB_NUM_0    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_USB)
#define USB_NUM_1    (1<<1)
#define DRV1_DEV_CH  (0 + USB_NUM_0)
#else
#define USB_NUM_1    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_USB)
#define USB_NUM_2    (1<<2)
#define DRV2_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1))
#else
#define USB_NUM_2    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_USB)
#define USB_NUM_3    (1<<3)
#define DRV3_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2))
#else
#define USB_NUM_3    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_USB)
#define USB_NUM_4    (1<<4)
#define DRV4_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) + (USB_NUM_3>>3))
#else
#define USB_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_USB)
#define USB_NUM_5    (1<<5)
#define DRV5_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) + (USB_NUM_3>>3) + (USB_NUM_4>>4))
#else
#define USB_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_USB)
#define USB_NUM_6    (1<<6)
#define DRV6_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5))
#else
#define USB_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_USB)
#define USB_NUM_7    (1<<7)
#define DRV7_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5) + (USB_NUM_6>>6))
#else
#define USB_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_USB)
#define USB_NUM_8    (1<<8)
#define DRV8_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5) + (USB_NUM_6>>6) + (USB_NUM_7>>7))
#else
#define USB_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_USB)
#define USB_NUM_9    (1<<9)
#define DRV9_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5) + (USB_NUM_6>>6) + (USB_NUM_7>>7) + (USB_NUM_8>>8))
#else
#define USB_NUM_9    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_USB)

static uint32_t TFAT_DRIVE_USB_ALLOC = (USB_NUM_9 | USB_NUM_8 | USB_NUM_7 | USB_NUM_6 | USB_NUM_5 | USB_NUM_4 | USB_NUM_3 | USB_NUM_2 | USB_NUM_1 | USB_NUM_0);

#if TFAT_USB_DRIVE_NUM != ( (USB_NUM_9>>9)+(USB_NUM_8>>8)+(USB_NUM_7>>7)+(USB_NUM_6>>6)+(USB_NUM_5>>5)+(USB_NUM_4>>4)+(USB_NUM_3>>3)+(USB_NUM_2>>2)+(USB_NUM_1>>1)+USB_NUM_0 )
#error "Error! Invalid setting for TFAT_USB_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif // (TFAT_USB_DRIVE_NUM > 0)


/* for SD memory card */
#if (TFAT_SDMEM_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_0   (1)
#define DRV0_DEV_CH   (0)
#else
#define SDMEM_NUM_0   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_1   (1<<1)
#define DRV1_DEV_CH   (0 + SDMEM_NUM_0)
#else
#define SDMEM_NUM_1   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_2   (1<<2)
#define DRV2_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1))
#else
#define SDMEM_NUM_2   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_3   (1<<3)
#define DRV3_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2))
#else
#define SDMEM_NUM_3   (0)
#endif //  (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_4   (1<<4)
#define DRV4_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) + (SDMEM_NUM_3>>3))
#else
#define SDMEM_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_5   (1<<5)
#define DRV5_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4))
#else
#define SDMEM_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_6   (1<<6)
#define DRV6_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5))
#else
#define SDMEM_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_7   (1<<7)
#define DRV7_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5) + (SDMEM_NUM_6>>6))
#else
#define SDMEM_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_8   (1<<8)
#define DRV8_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5) + (SDMEM_NUM_6>>6) + (SDMEM_NUM_7>>7))
#else
#define SDMEM_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_9   (1<<9)
#define DRV9_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5) + (SDMEM_NUM_6>>6) + (SDMEM_NUM_7>>7) + (SDMEM_NUM_8>>8))
#else
#define SDMEM_NUM_9   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SDMEM)

static uint32_t TFAT_DRIVE_SDMEM_ALLOC = (SDMEM_NUM_9 | SDMEM_NUM_8 | SDMEM_NUM_7 | SDMEM_NUM_6 | SDMEM_NUM_5 | SDMEM_NUM_4 | SDMEM_NUM_3 | SDMEM_NUM_2 | SDMEM_NUM_1 | SDMEM_NUM_0);

#if TFAT_SDMEM_DRIVE_NUM != ( (SDMEM_NUM_9>>9)+(SDMEM_NUM_8>>8)+(SDMEM_NUM_7>>7)+(SDMEM_NUM_6>>6)+(SDMEM_NUM_5>>5)+(SDMEM_NUM_4>>4)+(SDMEM_NUM_3>>3)+(SDMEM_NUM_2>>2)+(SDMEM_NUM_1>>1)+SDMEM_NUM_0 )
#error "Error! Invalid setting for TFAT_SDMEM_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif // (TFAT_SDMEM_DRIVE_NUM > 0)


/* for MMC */
#if (TFAT_MMC_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_MMC)
#define MMC_NUM_0    (1)
#define DRV0_DEV_CH  (0)
#else
#define MMC_NUM_0    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_MMC)
#define MMC_NUM_1    (1<<1)
#define DRV1_DEV_CH  (0 + MMC_NUM_0)
#else
#define MMC_NUM_1    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_MMC)
#define MMC_NUM_2    (1<<2)
#define DRV2_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1))
#else
#define MMC_NUM_2    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_MMC)
#define MMC_NUM_3    (1<<3)
#define DRV3_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2))
#else
#define MMC_NUM_3    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_MMC)
#define MMC_NUM_4    (1<<4)
#define DRV4_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) + (MMC_NUM_3>>3))
#else
#define MMC_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_MMC)
#define MMC_NUM_5    (1<<5)
#define DRV5_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) + (MMC_NUM_3>>3) + (MMC_NUM_4>>4))
#else
#define MMC_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_MMC)
#define MMC_NUM_6    (1<<6)
#define DRV6_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5))
#else
#define MMC_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_MMC)
#define MMC_NUM_7    (1<<7)
#define DRV7_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5) + (MMC_NUM_6>>6))
#else
#define MMC_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_MMC)
#define MMC_NUM_8    (1<<8)
#define DRV8_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5) + (MMC_NUM_6>>6) + (MMC_NUM_7>>7))
#else
#define MMC_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_MMC)
#define MMC_NUM_9    (1<<9)
#define DRV9_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5) + (MMC_NUM_6>>6) + (MMC_NUM_7>>7) + (MMC_NUM_8>>8))
#else
#define MMC_NUM_9    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_MMC)

