miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/******************************************************************************
* Function Name : chk_use_sdmem
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_SDMEM_DRIVE_NUM > 0)
static uint8_t chk_use_sdmem(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_SDMEM_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_SDMEM

/******************************************************************************
* Function Name : chk_use_mmc
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if TFAT_MMC_DRIVE_NUM > 0
static uint8_t chk_use_mmc(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_MMC_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_MMC

/******************************************************************************
* Function Name : chk_use_usb_mini
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
static uint8_t chk_use_usb_mini(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_USB_MINI_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_USB

/******************************************************************************
* Function Name : R_tfat_disk_initialize
* Description   : This function initializes the memory medium
*               :    for file operations
* Arguments     : uint8_t  drive        : Physical drive number for FIT module
* Return value  : Status of the memory medium
******************************************************************************/
DSTATUS R_tfat_disk_initialize(uint8_t drive)
{
    DSTATUS ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( chk_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_initialize( drive_alloc_tbl[drive][1] ); /* function for USB */
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if ( chk_use_sdmem(drive) )
    {
        ret = R_tfat_sdmem_disk_initialize( drive_alloc_tbl[drive][1] ); /* function for SDMEM */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( chk_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_initialize( drive_alloc_tbl[drive][1] ); /* function for USB Mini */
    }
#endif

    return  ret;
}

/******************************************************************************
* Function Name : R_tfat_disk_read
* Description   : This function reads data from the specified location
*               :    of the memory medium
* Arguments     : uint8_t  drive        : Physical drive number
*               : uint8_t* buffer       : Pointer to the read data buffer
*               : uint32_t sector_number : uint32_t SectorNumber
*               : uint8_t sector_count   : Number of sectors to read
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_disk_read (
    uint8_t drive,          /* Physical drive number             */
    uint8_t* buffer,        /* Pointer to the read data buffer   */
    uint32_t sector_number, /* Start sector number               */
    uint8_t sector_count    /* Number of sectors to read         */
)
{
    DRESULT ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( chk_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_read( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB */
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if ( chk_use_sdmem(drive) )
    {
        ret = R_tfat_sdmem_disk_read( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for SDMEM */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( chk_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_read( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB Mini */
    }
#endif

    return ret;
}

/******************************************************************************
* Function Name : R_tfat_disk_write
* Description   : This function writes data to a specified location
*               :    of the memory medium
* Arguments     : uint8_t Drive : Physical drive number
*               : const uint8_t* buffer       : Pointer to the write data
*               : uint32_t       sector_number : Sector number to write
*               : uint8_t        sector_count  : Number of sectors to write
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_disk_write (
    uint8_t drive,           /* Physical drive number           */
    const uint8_t* buffer,   /* Pointer to the write data       */
    uint32_t sector_number,  /* Sector number to write          */
    uint8_t sector_count     /* Number of sectors to write      */
)
{
    DRESULT ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( chk_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_write( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB */
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if ( chk_use_sdmem(drive) )
    {
        ret = R_tfat_sdmem_disk_write( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for SDMEM */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( chk_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_write( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB Mini */
    }
#endif

    return ret;
}

/******************************************************************************
* Function Name : R_tfat_disk_ioctl
* Description   : This function is used to execute memory operations
*               :    other than read\write
* Arguments     : uint8_t drive   : Drive number
*               : uint8_t command : Control command code
*               : void*   buffer  : Data transfer buffer
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_disk_ioctl (
    uint8_t drive,           /* Drive number             */
    uint8_t command,         /* Control command code     */
    void* buffer             /* Data transfer buffer     */
)
{
    DRESULT ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( chk_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_ioctl( drive_alloc_tbl[drive][1], command, buffer ); /* function for USB */
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if ( chk_use_sdmem(drive) )
    {
        ret = R_tfat_sdmem_disk_ioctl ( drive_alloc_tbl[drive][1], command, buffer ); /* function for SDMEM */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( chk_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_ioctl( drive_alloc_tbl[drive][1], command, buffer ); /* function for USB Mini */
    }
#endif

    return ret;
}

