miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/******************************************************************************
* Function Name : R_tfat_disk_status
* Description   : This function is used to retrieve the current status
*               :    of the disk
* Arguments     : uint8_t drive : Physical drive number
* Return value  : Status of the disk
******************************************************************************/
DSTATUS R_tfat_disk_status (
    uint8_t drive             /* Physical drive number    */
)
{
    DSTATUS ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( chk_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_status ( drive_alloc_tbl[drive][1] ); /* function for USB */
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if ( chk_use_sdmem(drive) )
    {
        ret = R_tfat_sdmem_disk_status ( drive_alloc_tbl[drive][1] ); /* function for SDMEM */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( chk_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_status ( drive_alloc_tbl[drive][1] ); /* function for USB Mini */
    }
#endif

    return ret;
}

/******************************************************************************
* Function Name : R_tfat_get_fattime
* Description   : This function returns the current date and time
* Arguments     : none
* Return value  : uint32_t
* NOTE          : Please DO NOT modify this function. This function
*               :    is used by the FAT library to get the current date
                :    and time during file manipulations.
******************************************************************************/
uint32_t R_tfat_get_fattime (void)
{
    uint32_t tmr;
    SYS_TIME time;

    /* Disable interrupts   */
    R_BSP_InterruptsDisable();

    R_SYS_TIME_GetCurrentTime(&time);

    /* Convert the time to store in FAT entry   */
    tmr =   (((uint32_t)time.year - 60) << 25);
    tmr |=  ((uint32_t)time.month << 21);
    tmr |=  ((uint32_t)time.day << 16);
    tmr |=  ((uint32_t)time.hour << 11);
    tmr |=  ((uint32_t)time.min << 5);
    tmr |=  ((uint32_t)time.sec >> 1);
    /* Enable interrupts    */
    R_BSP_InterruptsEnable();

    return tmr;
}

/******************************************************************************
* Function Name : R_tfat_drv_change_alloc
* Description   : This function is used to change drive allocation.
*               :    of the disk
* Arguments     : TFAT_DRV_NUM      tfat_drv : Physical drive number( in TFAT)
*               : uint8_t dev_type           : device define
*               : uint8_t dev_drv_num        : drive number/device channnel( in device driver)
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_drv_change_alloc(TFAT_DRV_NUM tfat_drv, uint8_t dev_type, uint8_t dev_drv_num )
{
    if ( TFAT_DRIVE_ALLOC_NUM_MAX <= tfat_drv )
    {
        return TFAT_RES_ERROR;
    }

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( TFAT_CTRL_USB == dev_type )
    {
        TFAT_DRIVE_USB_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_USB_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if ( TFAT_CTRL_SDMEM == dev_type )
    {
        TFAT_DRIVE_SDMEM_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_SDMEM_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_MMC_DRIVE_NUM > 0)
    if ( TFAT_CTRL_MMC == dev_type )
    {
        TFAT_DRIVE_MMC_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_MMC_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( TFAT_CTRL_USB_MINI == dev_type )
    {
        TFAT_DRIVE_USB_MINI_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_USB_MINI_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif

    drive_alloc_tbl[tfat_drv][0] = dev_type;
    drive_alloc_tbl[tfat_drv][1] = dev_drv_num;

    return TFAT_RES_OK;
}

/*******************************************************************************
End  of file
*******************************************************************************/
